InformationRegisters/ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МестоВСтруктуреПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияИспользованияШтатногоРасписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИспользованияШтатногоРасписания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыСотрудников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаботСДосрочнойПенсией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажаЛетныхЭкипажей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтажаЛетныхЭкипажей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажаШахтеров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтажаШахтеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиваетсяНадбавкаЗаВредность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПозицииСпискаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВСтруктуреПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НадбавкаЗаВредностьРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НадбавкаЗаВредностьРазмерМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НадбавкаЗаВредностьРазмерМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкладТариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкладТарифМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкладТарифМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтношениеКЕНВД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКЕНВДЗатратНаЗарплату</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныеДокументыПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНадбавкиЗаВредность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядКатегорияНадбавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРазмерМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРазмерМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СевернаяНадбавкаРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СевернаяНадбавкаРазмерМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СевернаяНадбавкаРазмерМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Comment>АПК:58 Способ отражения описывает счет и субконто</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСеткаНадбавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоваяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияПриема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТУправленческий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТУправленческийМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТУправленческийМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыполняемыхРаботПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РезультатыСпециальнойОценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РезультатыСпециальнойОценкиУсловийТруда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлассУсловийТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыявленыВредныеОпасныеФакторы</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/МестаПозицийШтатногоРасписанияВСтруктуреПредприятия/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьДвиженияИсторииИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия(Движения,
	ТаблицаДанныхДляПроведения) Экспорт

	Если Не ЗначениеЗаполнено(ТаблицаДанныхДляПроведения) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаДанныхДляПроведения Из ТаблицаДанныхДляПроведения Цикл
		СтрокаДвижений = Движения.ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаДанныхДляПроведения);
	КонецЦикла;

	Если Движения.ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Количество() > 0 Тогда
		Движения.ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Записывать = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписиИсторииИзмененияМестаПозицииВСтруктуре(НаборЗаписей, Отказ, Замещение) Экспорт

	Если Не ИспользоватьДокументИзмененияМестаПозицииВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормирования = ОрганизационнаяСтруктура.ПараметрыФормированияВторичныхДанныхМестаПозицииВСтруктуре(
		НаборЗаписей, Замещение);
	ОрганизационнаяСтруктура.ОбновитьВторичныеДанныеМестаПозицииВСтруктуре(ПараметрыФормирования, Отказ);

КонецПроцедуры

Функция ИспользоватьДокументИзмененияМестаПозицииВСтруктуреПредприятия() Экспорт

	Если ПолучитьФункциональнуюОпцию("ИспользоватьДокументИзмененияМестаПозицииВСтруктуреПредприятия") Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Функция ПроверитьВозможностьВнесенияИзменений(ТаблицаПозиций) Экспорт

	РезультатПроверки = Новый Структура("ИзмененияВозможны, Позиции", Истина, Новый Массив);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПозиций.Позиция КАК ПозицияШтатногоРасписания,
	|	ТаблицаПозиций.ДатаВступленияВСилу КАК Дата
	|ПОМЕСТИТЬ ВТПозицииДокумента
	|ИЗ
	|	&ТаблицаПозиций КАК ТаблицаПозиций
	|ГДЕ
	|	ТаблицаПозиций.Позиция <> ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
	|	И ТаблицаПозиций.ДатаВступленияВСилу <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПозицииДокумента.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
	|	ПозицииДокумента.Дата КАК Дата,
	|	МИНИМУМ(ИсторияИспользованияШтатногоРасписания.Дата) КАК ДатаПоследующихИзменений
	|ПОМЕСТИТЬ ВТДатыПоследующихИзменений
	|ИЗ
	|	ВТПозицииДокумента КАК ПозицииДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИспользованияШтатногоРасписания КАК
	|			ИсторияИспользованияШтатногоРасписания
	|		ПО ПозицииДокумента.ПозицияШтатногоРасписания = ИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания
	|		И ПозицииДокумента.Дата < ИсторияИспользованияШтатногоРасписания.Дата
	|СГРУППИРОВАТЬ ПО
	|	ПозицииДокумента.ПозицияШтатногоРасписания,
	|	ПозицииДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыПоследующихИзменений.ПозицияШтатногоРасписания КАК Позиция,
	|	ДатыПоследующихИзменений.Дата КАК Дата,
	|	ДатыПоследующихИзменений.ДатаПоследующихИзменений КАК ДатаИзменений,
	|	ИсторияИспользованияШтатногоРасписания.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ИсторияИспользованияШтатногоРасписания.Регистратор) КАК РегистраторПредставление
	|ИЗ
	|	ВТДатыПоследующихИзменений КАК ДатыПоследующихИзменений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИспользованияШтатногоРасписания КАК
	|			ИсторияИспользованияШтатногоРасписания
	|		ПО ДатыПоследующихИзменений.ПозицияШтатногоРасписания = ИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания
	|		И ДатыПоследующихИзменений.ДатаПоследующихИзменений = ИсторияИспользованияШтатногоРасписания.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаИзменений,
	|	Позиция";

	Запрос.УстановитьПараметр("ТаблицаПозиций", ТаблицаПозиций);
	
	УстановитьПривилегированныйРежим(Истина);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	РезультатПроверки.ИзмененияВозможны = Ложь;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл


		РезультатПроверкиИзменения = РезультатПроверкиИзменения();
		ЗаполнитьЗначенияСвойств(РезультатПроверкиИзменения, Выборка);
		
		РезультатПроверки.Позиции.Добавить(РезультатПроверкиИзменения);

	КонецЦикла;;

	Возврат РезультатПроверки;

КонецФункции

Функция ПроверитьСоответствиеМестВСтруктуреПредприятия(Позиции, ДатаПроверки) Экспорт

	РезультатПроверки = Новый Структура("ЕстьРасхождения, Позиции", Ложь, Новый Массив);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	Позиции.Позиция КАК Позиция,
	|	Позиции.МестоВСтруктуреПредприятия КАК Подразделение
	|ПОМЕСТИТЬ ВТПозиции
	|ИЗ
	|	&Позиции КАК Позиции";

	Запрос.УстановитьПараметр("Позиции", Позиции);
	Запрос.УстановитьПараметр("Период", ДатаПроверки);

	Запрос.Выполнить();

	ОрганизационнаяСтруктура.СоздатьВТМестаПозицийВСтруктуреПредприятияПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Позиции.Позиция КАК Позиция,
	|	МестаПозицийВСтруктуреПредприятия.Основание КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(МестаПозицийВСтруктуреПредприятия.Основание) КАК РегистраторПредставление
	|ИЗ
	|	ВТПозиции КАК Позиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМестаПозицийВСтруктуреПредприятия КАК МестаПозицийВСтруктуреПредприятия
	|		ПО Позиции.Позиция = МестаПозицийВСтруктуреПредприятия.Позиция
	|		И Позиции.Период = МестаПозицийВСтруктуреПредприятия.Период
	|ГДЕ
	|	Позиции.Подразделение <> МестаПозицийВСтруктуреПредприятия.Подразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Позиция";

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	РезультатПроверки.ЕстьРасхождения = Истина;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		РезультатПроверкиСоответствия = РезультатПроверкиСоответствия();
		ЗаполнитьЗначенияСвойств(РезультатПроверкиСоответствия, Выборка);
		
		РезультатПроверки.Позиции.Добавить(РезультатПроверкиСоответствия);
		
	КонецЦикла;

	Возврат РезультатПроверки;

КонецФункции

Функция ЗапросОбновленияМестаПозицийШтатногоРасписанияПоДвижениямИзмененияМеста() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсторияИспользованияШтатногоРасписания.Дата КАК Период,
	|	ИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания КАК Позиция,
	|	ИсторияИспользованияШтатногоРасписания.МестоВСтруктуреПредприятия КАК Подразделение,
	|	ИсторияИспользованияШтатногоРасписания.Регистратор КАК Основание,
	|	НЕ &ИспользоватьДокументИзмененияМестаПозицииВСтруктуреПредприятия КАК Приоритет
	|ПОМЕСТИТЬ ВТИсторияИзмененияМестаПозиции
	|ИЗ
	|	РегистрСведений.ИсторияИспользованияШтатногоРасписания КАК ИсторияИспользованияШтатногоРасписания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Период,
	|	ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.ПозицияШтатногоРасписания,
	|	ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.МестоВСтруктуреПредприятия,
	|	ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Регистратор,
	|	&ИспользоватьДокументИзмененияМестаПозицииВСтруктуреПредприятия
	|ИЗ
	|	РегистрСведений.ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия КАК
	|		ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияИзмененияМестаПозиции.Период КАК Период,
	|	ИсторияИзмененияМестаПозиции.Позиция КАК Позиция,
	|	МАКСИМУМ(Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТПриоритетыЗаписей
	|ИЗ
	|	ВТИсторияИзмененияМестаПозиции КАК ИсторияИзмененияМестаПозиции
	|СГРУППИРОВАТЬ ПО
	|	ИсторияИзмененияМестаПозиции.Период,
	|	ИсторияИзмененияМестаПозиции.Позиция
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Позиция,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияИзмененияМестаПозиции.Период КАК Период,
	|	ИсторияИзмененияМестаПозиции.Позиция КАК Позиция,
	|	ИсторияИзмененияМестаПозиции.Подразделение КАК Подразделение,
	|	ИсторияИзмененияМестаПозиции.Основание КАК Основание
	|ИЗ
	|	ВТИсторияИзмененияМестаПозиции КАК ИсторияИзмененияМестаПозиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриоритетыЗаписей КАК ПриоритетыЗаписей
	|		ПО ИсторияИзмененияМестаПозиции.Позиция = ПриоритетыЗаписей.Позиция
	|		И ИсторияИзмененияМестаПозиции.Период = ПриоритетыЗаписей.Период
	|		И ИсторияИзмененияМестаПозиции.Приоритет = ПриоритетыЗаписей.Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Позиция,
	|	Период";
	
	Запрос.УстановитьПараметр("ИспользоватьДокументИзмененияМестаПозицииВСтруктуреПредприятия",
		ИспользоватьДокументИзмененияМестаПозицииВСтруктуреПредприятия());
	
	Возврат Запрос;
	
КонецФункции

Процедура ДополнитьОписаниеПрофиляИзменение(ОписаниеПрофиля) Экспорт

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИзмененийМестПозицийШтатногоРасписанияВСтруктуреПредприятия");

КонецПроцедуры

Процедура ДополнитьОписаниеПрофиляЧтение(ОписаниеПрофиля) Экспорт

	ОписаниеПрофиля.Роли.Добавить("ЧтениеИзмененийМестПозицийШтатногоРасписанияВСтруктуреПредприятия");

КонецПроцедуры

Процедура ОбновитьЗависимыеДанныеПоИсторииИзмененияМестаПозиции(СтрокаТаблицы) Экспорт

	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.РегистрыСведений.ИсторияИспользованияШтатногоРасписания Тогда
		Возврат;
	КонецЕсли;

	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ПриЗаписиИсторииИзмененияМестаПозицииВСтруктуре(НаборЗаписей, Ложь, Истина);
	КонецЦикла;

КонецПроцедуры

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "22f0a6cd-c9e8-4a4d-8cd4-155f3aa343e4", Метаданные.Документы.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Справочник.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятияПрисоединенныеФайлы.Чтение.ПодразделенияОрганизаций
	|Справочник.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятияПрисоединенныеФайлы.Изменение.ПодразделенияОрганизаций
	|Документ.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Чтение.Организации
	|Документ.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Чтение.ПодразделенияОрганизаций
	|Документ.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Изменение.Организации
	|Документ.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Изменение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Чтение.Организации
	|РегистрСведений.ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Чтение.ПодразделенияОрганизаций";
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт

	Списки.Вставить(Метаданные.Документы.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия, Истина);
	Списки.Вставить(
		Метаданные.Справочники.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия,
		Истина);

КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзмененияДанных

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт

	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
		"Документ.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия", "ДатаЗапрета", "КадровыйУчет",
		"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда",
		"Период", "КадровыйУчет");

КонецПроцедуры

#КонецОбласти

#Область Печать

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати.
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатПроверкиИзменения()
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("РегистраторПредставление", "");
	РезультатПроверки.Вставить("Регистратор");
	РезультатПроверки.Вставить("Позиция");
	РезультатПроверки.Вставить("ДатаИзменений");
	РезультатПроверки.Вставить("Дата");
	
	Возврат РезультатПроверки;
	
КонецФункции

Функция РезультатПроверкиСоответствия()

	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("РегистраторПредставление", "");
	РезультатПроверки.Вставить("Регистратор");
	РезультатПроверки.Вставить("Позиция");
	
	Возврат РезультатПроверки;

КонецФункции

#КонецОбласти
